SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/inc/n32g430_adc.h
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
*\*\file n32g430_adc.h
*\*\author Nations
*\*\version v1.0.1
*\*\copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
**/

 
#ifndef __N32G430_ADC_H__
#define __N32G430_ADC_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "n32g430.h"
#include <stdbool.h>


/** ADC init structure definition **/
typedef struct
{
    FunctionalState MultiChEn;      /* Specifies whether the conversion is performed in
                                       Scan (multichannels) or Single (one channel) mode */

    FunctionalState ContinueConvEn; /* Specifies whether the conversion is performed in
                                       Continuous or Single mode */

    uint32_t ExtTrigSelect;         /* Defines the external trigger used to start the analog
                                       to digital conversion of regular channels */

    uint32_t DatAlign;              /* Specifies whether the ADC data alignment is left or right */

    uint32_t ChsNumber;             /* Specifies the number of ADC channels that will be converted
                                       using the sequencer for regular channel group */
} ADC_InitType;

typedef enum
{
    CMD_CR_SUCCESS  = 0x00,
    CMD_CR_FAILED   = 0x01,
}CMD_RETURN_CR;


/** ADC scan conversion define **/
#define ADC_MULTCH_ENABLE                    ((uint32_t)(ADC_CTRL1_SCANMD)) /* ADC_CTRL1 SCANMD bits */ 
#define ADC_MULTCH_DISABLE                   ((uint32_t)(~ADC_CTRL1_SCANMD)) 

/** ADC continue conversion define **/
#define ADC_CTU_ENABLE                       ((uint32_t)(ADC_CTRL2_CTU)) /* ADC_CTRL1 CTU bits */
#define ADC_CTU_DISABLE                      ((uint32_t)(~ADC_CTRL2_CTU)) 

/** ADC external trigger sources for regular channels conversion define **/
#define ADC_EXT_TRIGCONV_REGULAR_MASK        ((uint32_t)(~ADC_CTRL2_EXTRSEL)) /* ADC_CTRL2 EXTRSEL[2:0] bits Mask */
#define ADC_EXT_TRIGCONV_REGULAR_T1_CC1      ((uint32_t)0x00000000) 
#define ADC_EXT_TRIGCONV_REGULAR_T1_CC2      ((uint32_t)0x00020000) 
#define ADC_EXT_TRIGCONV_REGULAR_T1_CC3      ((uint32_t)0x00040000)
#define ADC_EXT_TRIGCONV_REGULAR_T2_CC2      ((uint32_t)0x00060000) 
#define ADC_EXT_TRIGCONV_REGULAR_T3_TRGO     ((uint32_t)0x00080000) 
#define ADC_EXT_TRIGCONV_REGULAR_T4_CC4      ((uint32_t)0x000A0000) 
#define ADC_EXT_TRIGCONV_REGULAR_EXT_INT11_TIM8_TRGO ((uint32_t)0x000C0000) 
#define ADC_EXT_TRIGCONV_REGULAR_SWSTRRCH    ((uint32_t)0x000E0000) 

/** ADC data alignment define **/
#define ADC_ALIG_MASK                        ((uint32_t)(~ADC_CTRL2_ALIG)) /* ADC_CTRL2 ALIG bits Mask */
#define ADC_DAT_ALIGN_R                      ((uint32_t)0x00000000)
#define ADC_DAT_ALIGN_L                      ((uint32_t)0x00000800)

/** ADC regular channel sequence length define **/
#define ADC_REGULAR_LEN_MSAK                 ((uint32_t)(~ADC_RSEQ1_LEN)) /* ADC_RSEQ1 LEN[3:0] bits Mask */
#define ADC_REGULAR_LEN_1                    ((uint32_t)0x00000000)
#define ADC_REGULAR_LEN_2                    ((uint32_t)0x00100000)
#define ADC_REGULAR_LEN_3                    ((uint32_t)0x00200000)
#define ADC_REGULAR_LEN_4                    ((uint32_t)0x00300000)
#define ADC_REGULAR_LEN_5                    ((uint32_t)0x00400000)
#define ADC_REGULAR_LEN_6                    ((uint32_t)0x00500000)
#define ADC_REGULAR_LEN_7                    ((uint32_t)0x00600000)
#define ADC_REGULAR_LEN_8                    ((uint32_t)0x00700000)
#define ADC_REGULAR_LEN_9                    ((uint32_t)0x00800000)
#define ADC_REGULAR_LEN_10                   ((uint32_t)0x00900000)
#define ADC_REGULAR_LEN_11                   ((uint32_t)0x00A00000)
#define ADC_REGULAR_LEN_12                   ((uint32_t)0x00B00000)
#define ADC_REGULAR_LEN_13                   ((uint32_t)0x00C00000)
#define ADC_REGULAR_LEN_14                   ((uint32_t)0x00D00000)
#define ADC_REGULAR_LEN_15                   ((uint32_t)0x00E00000)
#define ADC_REGULAR_LEN_16                   ((uint32_t)0x00F00000)

/** ADC channels define **/
#define ADC_CH_0                             ((uint8_t)0x00)
#define ADC_CH_1                             ((uint8_t)0x01)
#define ADC_CH_2                             ((uint8_t)0x02)
#define ADC_CH_3                             ((uint8_t)0x03)
#define ADC_CH_4                             ((uint8_t)0x04)
#define ADC_CH_5                             ((uint8_t)0x05)
#define ADC_CH_6                             ((uint8_t)0x06)
#define ADC_CH_7                             ((uint8_t)0x07)
#define ADC_CH_8                             ((uint8_t)0x08)
#define ADC_CH_9                             ((uint8_t)0x09)
#define ADC_CH_10                            ((uint8_t)0x0A)
#define ADC_CH_11                            ((uint8_t)0x0B)
#define ADC_CH_12                            ((uint8_t)0x0C)
#define ADC_CH_13                            ((uint8_t)0x0D)
#define ADC_CH_14                            ((uint8_t)0x0E)
#define ADC_CH_15                            ((uint8_t)0x0F)
#define ADC_CH_16                            ((uint8_t)0x10)
#define ADC_CH_17                            ((uint8_t)0x11)
#define ADC_CH_18                            ((uint8_t)0x12)
#define ADC_CH_TEMP_SENSOR                   ((uint8_t)ADC_CH_17)
#define ADC_CH_INT_VREF                      ((uint8_t)ADC_CH_0)
#define ADC_CH_BUFF_VREF                     ((uint8_t)ADC_CH_18)

