SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/inc/n32g430_adc.h
#define ADC_Channel_01_PA0                  ((uint8_t)0x01)
#define ADC_Channel_02_PA1                  ((uint8_t)0x02)
#define ADC_Channel_03_PA2                  ((uint8_t)0x03)
#define ADC_Channel_04_PA3                  ((uint8_t)0x04)
#define ADC_Channel_05_PA4                  ((uint8_t)0x05)
#define ADC_Channel_06_PA5                  ((uint8_t)0x06)
#define ADC_Channel_07_PA6                  ((uint8_t)0x07)
#define ADC_Channel_08_PA7                  ((uint8_t)0x08)
#define ADC_Channel_09_PB0                  ((uint8_t)0x09)
#define ADC_Channel_10_PB1                  ((uint8_t)0x0A)
#define ADC_Channel_11_PB2                  ((uint8_t)0x0B)
#define ADC_Channel_12_PB10                 ((uint8_t)0x0C)
#define ADC_Channel_13_PB11                 ((uint8_t)0x0D)
#define ADC_Channel_14_PB12                 ((uint8_t)0x0E)
#define ADC_Channel_15_PB13                 ((uint8_t)0x0F)
#define ADC_Channel_16_PB14                 ((uint8_t)0x10)

/** ADC converter operation define **/
#define ADC_TURN_ON                          ((uint32_t)ADC_CTRL2_ON)    /* ADC_CTRL2 ON bit */
#define ADC_TURN_OFF                         ((uint32_t)(~ADC_CTRL2_ON)) 

/** ADC DMA Config define **/
#define ADC_DMA_ENABLE                       ((uint32_t)ADC_CTRL2_ENDMA)    /* ADC_CTRL2 ENDMA bit */
#define ADC_DMA_DISABLE                      ((uint32_t)(~ADC_CTRL2_ENDMA)) 

/** ADC interrupts define **/
#define ADC_INT_ENDC                         ((uint32_t)ADC_CTRL1_ENDCIEN)   /* ADC_CTRL1 ENDCIEN bits */
#define ADC_INT_AWD                          ((uint32_t)ADC_CTRL1_AWDGIEN)   /* ADC_CTRL1 AWDGIEN bits */
#define ADC_INT_JENDC                        ((uint32_t)ADC_CTRL1_JENDCIEN)  /* ADC_CTRL1 JENDCIEN bits */
#define ADC_INT_ENDCA                        ((uint32_t)ADC_CTRL3_ENDCAIEN)  /* ADC_CTRL3 ENDCAIEN bits */
#define ADC_INT_JENDCA                       ((uint32_t)ADC_CTRL3_JENDCAIEN) /* ADC_CTRL3 JENDCAIEN bits */

/** ADC calibration operation define **/
#define ADC_CALIBRATION_ENABLE               ((uint32_t)0x00000001)
#define ADC_CALIBRATION_STS                  ((uint32_t)0x00000002)

/** ADC regular channels software conversion operation define **/
#define ADC_EXTRTRIG_SWSTRRCH_ENABLE         ((uint32_t)(ADC_CTRL2_EXTRTRIG | ADC_CTRL2_SWSTRRCH))
#define ADC_EXTRTRIG_SWSTRRCH_DISABLE        ((uint32_t)(~(ADC_CTRL2_EXTRTRIG | ADC_CTRL2_SWSTRRCH)))
#define ADC_EXTRTRIG_SWSTRRCH_GET_STS        ((uint32_t)ADC_CTRL2_SWSTRRCH)

/** ADC channels count of discontinuous mode define **/
#define ADC_CHANNEL_COUNT_MASK               ((uint32_t)(~ADC_CTRL1_DCTU)) /* ADC_CTRL1 DCTU[2:0] bit Mask */
#define ADC_CHANNEL_COUNT_1                  ((uint32_t)0x00000000)
#define ADC_CHANNEL_COUNT_2                  ((uint32_t)0x00002000)
#define ADC_CHANNEL_COUNT_3                  ((uint32_t)0x00004000)
#define ADC_CHANNEL_COUNT_4                  ((uint32_t)0x00006000)
#define ADC_CHANNEL_COUNT_5                  ((uint32_t)0x00008000)
#define ADC_CHANNEL_COUNT_6                  ((uint32_t)0x0000A000)
#define ADC_CHANNEL_COUNT_7                  ((uint32_t)0x0000C000)
#define ADC_CHANNEL_COUNT_8                  ((uint32_t)0x0000E000)

/** ADC discontinuous mode on regular or injected group operation define **/
#define ADC_DISCMODE_REGULAR_ENABLE          ((uint32_t)ADC_CTRL1_DREGCH)
#define ADC_DISCMODE_REGULAR_DISABLE         ((uint32_t)(~ADC_CTRL1_DREGCH))
#define ADC_DISCMODE_INJECTED_ENABLE         ((uint32_t)ADC_CTRL1_DJCH)
#define ADC_DISCMODE_INJECTED_DISABLE        ((uint32_t)(~ADC_CTRL1_DJCH))

/** ADC sampling time define **/
#define ADC_SAMP_TIME_UNIT                   ((uint32_t)0x00000007)
#define ADC_SAMP_TIME_UNIT_OFFSET            ((uint8_t)0x03) //kuohao
#define ADC_SAMP_TIME_MASK(offset)           ((uint32_t)(~(ADC_SAMP_TIME_UNIT << ((offset) * ADC_SAMP_TIME_UNIT_OFFSET))))
#define ADC_SAMP_TIME_1CYCLES5               ((uint8_t)0x00)
#define ADC_SAMP_TIME_7CYCLES5               ((uint8_t)0x01)
#define ADC_SAMP_TIME_13CYCLES5              ((uint8_t)0x02)
#define ADC_SAMP_TIME_28CYCLES5              ((uint8_t)0x03)
#define ADC_SAMP_TIME_41CYCLES5              ((uint8_t)0x04)
#define ADC_SAMP_TIME_55CYCLES5              ((uint8_t)0x05)
#define ADC_SAMP_TIME_71CYCLES5              ((uint8_t)0x06)
#define ADC_SAMP_TIME_239CYCLES5             ((uint8_t)0x07)

/** ADC regular sequence number define **/
#define ADC_REG_SEQ_NUM_OFFSET1              ((uint8_t)0x05)
#define ADC_REG_SEQ_NUM_OFFSET2              ((uint8_t)0x0B)
#define ADC_REG_SEQ_NUM_OFFSET3              ((uint8_t)(ADC_REG_SEQ_NUM_OFFSET2 - ADC_REG_SEQ_NUM_OFFSET1))
#define ADC_REG_SEQ_NUM_OFFSET4              ((uint8_t)0x0C)
#define ADC_REGULAR_NUM_UNIT                 ((uint32_t)0x0000001F)
#define ADC_REGULAR_NUM_UNIT_OFFSET          ((uint8_t)0x05)
#define ADC_REGULAR_NUMBER_MASK(num)         ((uint32_t)(~(ADC_REGULAR_NUM_UNIT << ((num) * ADC_REGULAR_NUM_UNIT_OFFSET))))
#define ADC_REGULAR_NUMBER_SET(ch, num)      ((uint32_t)((ch) << ((num) * ADC_REGULAR_NUM_UNIT_OFFSET)))
#define ADC_REGULAR_NUMBER_1                 ((uint8_t)0x00)
#define ADC_REGULAR_NUMBER_2                 ((uint8_t)0x01)
#define ADC_REGULAR_NUMBER_3                 ((uint8_t)0x02)
#define ADC_REGULAR_NUMBER_4                 ((uint8_t)0x03)
#define ADC_REGULAR_NUMBER_5                 ((uint8_t)0x04)
#define ADC_REGULAR_NUMBER_6                 ((uint8_t)0x05)
#define ADC_REGULAR_NUMBER_7                 ((uint8_t)0x06)
#define ADC_REGULAR_NUMBER_8                 ((uint8_t)0x07)
#define ADC_REGULAR_NUMBER_9                 ((uint8_t)0x08)
#define ADC_REGULAR_NUMBER_10                ((uint8_t)0x09)
#define ADC_REGULAR_NUMBER_11                ((uint8_t)0x0A)
#define ADC_REGULAR_NUMBER_12                ((uint8_t)0x0B)
#define ADC_REGULAR_NUMBER_13                ((uint8_t)0x0C)
#define ADC_REGULAR_NUMBER_14                ((uint8_t)0x0D)
#define ADC_REGULAR_NUMBER_15                ((uint8_t)0x0E)
#define ADC_REGULAR_NUMBER_16                ((uint8_t)0x0F)

/** ADC external trigger source enable or disable define **/
#define ADC_EXTTRIGCONV_REGULAR_ENABLE       ((uint32_t)ADC_CTRL2_EXTRTRIG)    /* ADC_CTRL2 EXTRTRIG bit */
#define ADC_EXTTRIGCONV_REGULAR_DISABLE      ((uint32_t)(~ADC_CTRL2_EXTRTRIG)) 
#define ADC_EXTTRIGCONV_INJECTED_ENABLE      ((uint32_t)ADC_CTRL2_EXTJTRIG)    /* ADC_CTRL2 EXTJTRIG bit */
#define ADC_EXTTRIGCONV_INJECTED_DISABLE     ((uint32_t)(~ADC_CTRL2_EXTJTRIG)) 

/** ADC injected group auto conversion mode define **/
#define ADC_INJECTED_AUTOCONV_ENABLE         ((uint32_t)ADC_CTRL1_AUTOJC)    
#define ADC_INJECTED_AUTOCONV_DISABLE        ((uint32_t)(~ADC_CTRL1_AUTOJC)) 

