SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/inc/n32g430_adc.h
/** ADC ctrl3 definition **/ 
#define ADC_VBAT_MONITOR_ENABLE      ((uint32_t)ADC_CTRL3_VBATMEN)    
#define ADC_VBAT_MONITOR_DISABLE     ((uint32_t)(~ADC_CTRL3_VBATMEN))  

#define ADC_DEEP_POWER_ENABLE        ((uint32_t)ADC_CTRL3_DPWMOD)
#define ADC_DEEP_POWER_DISABLE       ((uint32_t)~ADC_CTRL3_DPWMOD)

#define ADC_JENDCAIEN_MSK            ((uint32_t)ADC_CTRL3_JENDCAIEN)
#define ADC_ENDCAIEN_MSK             ((uint32_t)ADC_CTRL3_ENDCAIEN)

#define ADC_BYPASSES_CAL_ENABLE      ((uint32_t)ADC_CTRL3_BPCAL)
#define ADC_BYPASSES_CAL_DISABLE     ((uint32_t)~ADC_CTRL3_BPCAL)

#define ADC_POWER_DOWN_RDY_MSK       ((uint32_t)ADC_CTRL3_PDRDY)
#define ADC_RDY_MSK                  ((uint32_t)ADC_CTRL3_RDY)

#define ADC_CLOCK_PLL                ((uint32_t)ADC_CTRL3_CKMOD)
#define ADC_CLOCK_AHB                ((uint32_t)~ADC_CTRL3_CKMOD)

#define ADC_CALALD_ENABLE            ((uint32_t)ADC_CTRL3_CALALD)
#define ADC_CALALD_DISABLE           ((uint32_t)~ADC_CTRL3_CALALD)

#define ADC_CALDIF_ENABLE            ((uint32_t)ADC_CTRL3_CALDIF)
#define ADC_CALDIF_DISABLE           ((uint32_t)~ADC_CTRL3_CALDIF)

#define ADC_RES_MSK                  ((uint32_t)~ADC_CTRL3_RES)

/** ADC bit num definition **/
#define ADC_RST_BIT_12      ((uint32_t)0x03)
#define ADC_RST_BIT_10      ((uint32_t)0x02)
#define ADC_RST_BIT_8       ((uint32_t)0x01)
#define ADC_RST_BIT_6       ((uint32_t)0x00)

/** ADC differential select channel definition **/
#define ADC_DIFSEL_CHS_MASK ((uint32_t)~ADC_DIFSEL_DIFSEL)
#define ADC_DIFSEL_CHS_0    ((uint32_t)ADC_DIFSEL_DIFSEL_0)
#define ADC_DIFSEL_CHS_1    ((uint32_t)ADC_DIFSEL_DIFSEL_1)
#define ADC_DIFSEL_CHS_2    ((uint32_t)ADC_DIFSEL_DIFSEL_2)
#define ADC_DIFSEL_CHS_3    ((uint32_t)ADC_DIFSEL_DIFSEL_3)
#define ADC_DIFSEL_CHS_4    ((uint32_t)ADC_DIFSEL_DIFSEL_4)
#define ADC_DIFSEL_CHS_5    ((uint32_t)ADC_DIFSEL_DIFSEL_5)
#define ADC_DIFSEL_CHS_6    ((uint32_t)ADC_DIFSEL_DIFSEL_6)
#define ADC_DIFSEL_CHS_7    ((uint32_t)ADC_DIFSEL_DIFSEL_7)
#define ADC_DIFSEL_CHS_8    ((uint32_t)ADC_DIFSEL_DIFSEL_8)
#define ADC_DIFSEL_CHS_9    ((uint32_t)ADC_DIFSEL_DIFSEL_9)
#define ADC_DIFSEL_CHS_10   ((uint32_t)ADC_DIFSEL_DIFSEL_10)
#define ADC_DIFSEL_CHS_11   ((uint32_t)ADC_DIFSEL_DIFSEL_11)
#define ADC_DIFSEL_CHS_12   ((uint32_t)ADC_DIFSEL_DIFSEL_12)
#define ADC_DIFSEL_CHS_13   ((uint32_t)ADC_DIFSEL_DIFSEL_13)
#define ADC_DIFSEL_CHS_14   ((uint32_t)ADC_DIFSEL_DIFSEL_14) 
#define ADC_DIFSEL_CHS_15   ((uint32_t)ADC_DIFSEL_DIFSEL_15)
#define ADC_DIFSEL_CHS_16   ((uint32_t)ADC_DIFSEL_DIFSEL_16)
#define ADC_DIFSEL_CHS_17   ((uint32_t)ADC_DIFSEL_DIFSEL_17)
#define ADC_DIFSEL_CHS_18   ((uint32_t)ADC_DIFSEL_DIFSEL_18)

/** ADC Driving Functions Declaration **/
extern CMD_RETURN_CR (*Program_NVR)(uint32_t addr, uint32_t  data);
extern CMD_RETURN_CR     (*Get_NVR)(uint32_t addr, uint32_t* data); 

void ADC_Reset(void);

void ADC_Multichannels_Enable(void);
void ADC_Multichannels_Disable(void);

void ADC_Continue_Conversion_Enable(void);
void ADC_Continue_Conversion_Disable(void);

void ADC_Regular_Group_External_Trigger_Source_Config(uint32_t external_trigger_sources);
void ADC_Data_Alignment_Config(uint32_t data_alignment);
void ADC_Regular_Channels_Number_Config(uint32_t channels_number);

void ADC_Initializes(ADC_InitType* ADC_initstruct);
void ADC_Initializes_Structure(ADC_InitType* ADC_initstruct);

void ADC_ON(void);
void ADC_OFF(void);

void ADC_DMA_Transfer_Enable(void);
void ADC_DMA_Transfer_Disable(void);

void ADC_Interrupts_Enable(uint32_t adc_interrupt);
void ADC_Interrupts_Disable(uint32_t adc_interrupt);

FlagStatus ADC_Calibration_Operation(uint32_t calibration_operation);

FlagStatus ADC_Regular_Channels_Software_Conversion_Operation(uint32_t conversion_operation);

void ADC_Discontinuous_Mode_Channel_Count_Config(uint32_t channel_count);
void ADC_Discontinuous_Mode_Config(uint32_t group_operation);

void ADC_Channel_Sample_Time_Config(uint8_t channel, uint8_t sample_time);
void ADC_Regular_Sequence_Conversion_Number_Config(uint8_t channel, uint8_t number);
void ADC_External_Trigger_Conversion_Config(uint32_t group_operation);
uint16_t ADC_Regular_Group_Conversion_Data_Get(void);

void ADC_Injected_Group_Autoconversion_Enable(void);
void ADC_Injected_Group_Autoconversion_Disable(void);

void ADC_Injected_Group_External_Trigger_Source_Config(uint32_t external_trigger_sources);
FlagStatus ADC_Injected_Channels_Software_Conversion_Operation(uint32_t conversion_operation);
void ADC_Injected_Sequence_Conversion_Number_Config(uint8_t channel, uint8_t number);
void ADC_Injected_Channels_Number_Config(uint32_t channels_number);
void ADC_Injected_Channels_Offset_Config(uint8_t injected_channel, uint16_t offset_data);
uint16_t ADC_Injected_Group_Conversion_Data_Get(uint8_t reg_offset);

void ADC_Analog_Watchdog_Mode_Channel_Config(uint32_t mode, uint8_t channel);
void ADC_Analog_Watchdog_Enable(uint32_t wcdg_mode);
void ADC_Analog_Watchdog_Disable(uint32_t wcdg_mode);
void ADC_Analog_Watchdog_HighThresholds_Config(uint16_t high_thresholds);
void ADC_Analog_Watchdog_LowThresholds_Config(uint16_t low_thresholds);

void ADC_Temperature_Sensor_And_Vrefint_Channel_Enable(void);
void ADC_Temperature_Sensor_And_Vrefint_Channel_Disable(void);

FlagStatus ADC_INTFlag_Status_Get(uint8_t adc_flag);
FlagStatus ADC_Flag_Status_Get(uint8_t selflag, uint8_t adc_runflag, uint8_t adc_rdflag);
void ADC_INTFlag_Status_Clear(uint8_t adc_flag);
void ADC_Flag_Status_Clear(uint8_t adc_flag);

void ADC_Vbat_Monitor_Enable(void);
void ADC_Vbat_Monitor_Disable(void);

void ADC_Deep_Power_Mode_Enable(void);
void ADC_Deep_Power_Mode_Disable(void);

void ADC_AHB_Clock_Mode_Config(void);
void ADC_PLL_Clock_Mode_Config(void);

void ADC_Calibration_Auto_Load_Enable(void);
void ADC_Calibration_Auto_Load_Disable(void);

void ADC_Differential_Mode_Enable(void);
void ADC_Differential_Mode_Disable(void);

void ADC_Data_Resolution_Config(uint32_t resbit);
void ADC_Sample_Time_Level_Config(uint32_t sample_time_level);

void ADC_Initializes_Ex(ADC_InitTypeEx* ADC_initstructEx);
void ADC_Initializes_StructureEx(ADC_InitTypeEx* ADC_initstructEx);

void ADC_Bypass_Calibration_Enable(void);
void ADC_Bypass_Calibration_Disable(void);

void ADC_Differential_Channels_Config(uint32_t difchs);
void ADC_Clock_Mode_Config(ADC_CKMOD ADC_clkmode, uint32_t RCC_ADCHCLKprescaler);
uint32_t ADC_Vrefint_Get(void);

#ifdef __cplusplus
}
#endif

#endif /*__N32G430_ADC_H__ */



